danielRep/mcu-tpa-eval/src/app/cy8cproto063/core0/platform_init.c
/*
 * Authors:
 *      Daniel Oliveira <daniel.oliveira@tango-project.org>
 *      Sandro Pinto <sandro.pinto@tango-project.org>
 *
 * contention-eval is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by
 * the Free Software Foundation.
 *
 */

#include "content_eval.h"
#include "platform_base_addrs.h"
#include "platform_config.h"
#include "dma_driver.h"

/* Platform BSP Includes*/
#include "cyhal_uart.h"

cyhal_uart_t cy_retarget_io_uart_obj;
static char cy_retarget_io_stdout_prev_char = 0;

static inline cy_rslt_t cy_retarget_io_getchar(char* c)
{
    return cyhal_uart_getc(&cy_retarget_io_uart_obj, (uint8_t*)c, 0);
}

static inline cy_rslt_t cy_retarget_io_putchar(char c)
{
    return cyhal_uart_putc(&cy_retarget_io_uart_obj, (uint8_t)c);
}

bool uart_init(void)
{
    const cyhal_uart_cfg_t uart_config =
    {
        .data_bits          = 8,
        .stop_bits          = 1,
        .parity             = CYHAL_UART_PARITY_NONE,
        .rx_buffer          = NULL,
        .rx_buffer_size     = 0
    };

    cy_rslt_t result = cyhal_uart_init(&cy_retarget_io_uart_obj, CYBSP_UART_TX, CYBSP_UART_RX, CYBSP_UART_CTS, CYBSP_UART_RTS, NULL,
                                       &uart_config);

    if (result == CY_RSLT_SUCCESS)
    {
        result = cyhal_uart_set_baud(&cy_retarget_io_uart_obj, CY_RETARGET_IO_BAUDRATE, NULL);
    }

    return true;
}

void pins_init(void)
{
    return;
}

void systemclock_config(void)
{
    return;
}

int _read(int file, char *ptr, int len)
{
    (void)file;

    int32_t nChars = 0;
    if (ptr != NULL)
    {
        cy_rslt_t rslt;
        do
        {
            rslt = cy_retarget_io_getchar(ptr);
            if (rslt == CY_RSLT_SUCCESS)
            {
                ++nChars;
                if ((*ptr == '\n') || (*ptr == '\r'))
                {
                    break;
                }
                ptr++;
            }
        } while ((rslt == CY_RSLT_SUCCESS) && (nChars < len));
    }

    return (nChars);
}

int _write(int file, const uint8_t *ptr, int len)
{
    int32_t nChars = 0;
    (void)file;
    if (ptr != NULL)
    {
        cy_rslt_t rslt = CY_RSLT_SUCCESS;

        for (; nChars < len; ++nChars)
        {
            if ((*ptr == '\n') && (cy_retarget_io_stdout_prev_char != '\r'))
            {
                rslt = cy_retarget_io_putchar('\r');
            }

            if (CY_RSLT_SUCCESS == rslt)
            {
                rslt = cy_retarget_io_putchar((uint32_t)*ptr);
            }

            if (CY_RSLT_SUCCESS != rslt)
            {
                break;
            }

            cy_retarget_io_stdout_prev_char = *ptr;
            ++ptr;
        }
    }
    return (nChars);
}

int platform_init(void)
{
    SCB->VTOR = (uint32_t)&__Vectors;
#if C0_CLK_MAX
    systemclock_config();
#endif

    if(!(uart_init()))
    {
        return -1;
    }

    pins_init();

    printf(CLEARSCREEN);
    printf(RED "System clock configured: %ld.\n", SystemCoreClock);

#ifdef MULTICORE
    printf(RED "Core1 setup and running "INTRFAPP" interf app.\n");
    printf(YELLOW "\t- VTOR: %.8X\n", 0xDEADBEEF);
#endif

#ifdef FPM
    printf(RED "Flash Performance mode configured.\n");
    printf(YELLOW "\t- accelerator 0xDEADBEEF\n");
    printf(YELLOW "\t- prefetcher 0xDEADBEEF\n");
#else
    //SYSCON->FMCCR &= ~(SYSCON_FMCCR_FETCHCFG_MASK | SYSCON_FMCCR_DATACFG_MASK | SYSCON_FMCCR_ACCEL_MASK | SYSCON_FMCCR_PREFEN_MASK);
#endif

#ifdef C0_DMA0
    dma0_init();
#endif

#ifdef C0_DMA1
    dma1_init();
#endif

    return 0;
}
